# type: brew bundle

cask_args appdir: '/Applications'

# Taps
tap 'homebrew/cask-versions'

# Binaries
brew 'curl'
brew 'git'
brew 'coreutils' # Those that come with macOS are outdated
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-completions'
brew 'mas' # Mac App Store manager
brew 'wget'
brew 'cowsay'

###  Casks  ###

# Development
brew 'node'
#brew 'yarn'

# applications
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'android-file-transfer'
cask 'iriunwebcam'
cask 'monitorcontrol'
cask 'mounty'
cask 'notion'
cask 'slack'
cask 'spotify'
cask 'firefox-developer-edition'
cask 'maccy'
cask 'google-backup-and-sync'
cask 'appcleaner'
cask 'iina'
cask 'visual-studio-code'
cask 'zoomus'

# quicklock plugins
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'webpquicklook'


# App Store applications
mas 'Telegram', id: 747648890
mas 'Notability', id: 736189492
mas 'AdBlock Pro for Safari', id: 1018301773
mas 'Pages', id: 409201541
mas 'Keynote', id: 409183694

